HarryZeng/STM32F0_LZ8CCD/user/BSP_Init.c
#include "bsp_init.h"
#include "stm32f0xx.h"
#include "stm32f0xx_tim.h"
#include "stm32f0xx_flash.h"
#include "stm32f0xx_adc.h"
#include "stm32f0xx_dma.h"
#include "stm32f0xx_dac.h"
#include "stm32f0xx_gpio.h"
#include "stm32f0xx_misc.h"
#include "stm32f0xx_rcc.h"

int16_t adc_dma_tab[DMA_BUFFER_SIZE];  

void RCC_Configuration(void)
{
	RCC_PLLConfig(RCC_PLLSource_HSI_Div2,RCC_PLLMul_12);
	RCC_PLLCmd(ENABLE);
	RCC_ADCCLKConfig(RCC_ADCCLK_PCLK_Div4);
	while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY)==RESET)
	{
		
	}
	
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
	
	while(RCC_GetSYSCLKSource()!=0x08)
	{
	}
}

/*******************************************
ÊýÂëGPIO³õÊ¼»¯
********************************************/
void SMG_GPIO_INIT(void)
{
	
	   GPIO_InitTypeDef GPIO_InitStructure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE); 
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);   
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOF, ENABLE);  
		
	
    GPIO_StructInit(&GPIO_InitStructure);  
	
//		GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);  //PB3,PB4,PA15£¬×÷ÎªÆÕÍ¨IOÊ¹ÓÃ
//		GPIO_PinRemapConfig( GPIO_Remap_PD01 , ENABLE );

		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; 
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz; 

	
    GPIO_InitStructure.GPIO_Pin = D4_Pin;  
    GPIO_Init(D4_GPIO_Port, &GPIO_InitStructure); 
		GPIO_InitStructure.GPIO_Pin = D3_Pin;
		GPIO_Init(D3_GPIO_Port, &GPIO_InitStructure);  
		GPIO_InitStructure.GPIO_Pin = D2_Pin;
		GPIO_Init(D2_GPIO_Port, &GPIO_InitStructure); 
		GPIO_InitStructure.GPIO_Pin = D1_Pin;
		GPIO_Init(D1_GPIO_Port, &GPIO_InitStructure); 
	  //GPIOD5~7                                                       
    GPIO_InitStructure.GPIO_Pin = D5_Pin;                            
    GPIO_Init(D5_GPIO_Port, &GPIO_InitStructure); 
		GPIO_InitStructure.GPIO_Pin = D6_Pin;  		
		GPIO_Init(D6_GPIO_Port, &GPIO_InitStructure);  
		GPIO_InitStructure.GPIO_Pin = D7_Pin;  
		GPIO_Init(D7_GPIO_Port, &GPIO_InitStructure);  
		//GPIOA                                                        
    GPIO_InitStructure.GPIO_Pin = D8_Pin;	
    GPIO_Init(D8_GPIO_Port, &GPIO_InitStructure);  
		GPIO_InitStructure.GPIO_Pin = D9_Pin;  
		GPIO_Init(D9_GPIO_Port, &GPIO_InitStructure);  

		//GPIOB
	  GPIO_InitStructure.GPIO_Pin = A_Pin;             
		GPIO_Init(A_GPIO_Port, &GPIO_InitStructure);
		GPIO_InitStructure.GPIO_Pin = B_Pin; 
		GPIO_Init(B_GPIO_Port, &GPIO_InitStructure);
		GPIO_InitStructure.GPIO_Pin = C_Pin; 
		GPIO_Init(C_GPIO_Port, &GPIO_InitStructure);
		GPIO_InitStructure.GPIO_Pin = D_Pin; 
		GPIO_Init(D_GPIO_Port, &GPIO_InitStructure);
		GPIO_InitStructure.GPIO_Pin = E_Pin; 
		GPIO_Init(E_GPIO_Port, &GPIO_InitStructure);
		GPIO_InitStructure.GPIO_Pin = F_Pin; 
		GPIO_Init(F_GPIO_Port, &GPIO_InitStructure);
		GPIO_InitStructure.GPIO_Pin = G_Pin; 
		GPIO_Init(G_GPIO_Port, &GPIO_InitStructure); 
		
		
		GPIO_WriteBit(D1_GPIO_Port, D1_Pin, Bit_SET);
		GPIO_WriteBit(D2_GPIO_Port, D2_Pin, Bit_SET);
		GPIO_WriteBit(D3_GPIO_Port, D3_Pin, Bit_SET);
		GPIO_WriteBit(D4_GPIO_Port, D4_Pin, Bit_SET);
		GPIO_WriteBit(D5_GPIO_Port, D5_Pin, Bit_SET);
		GPIO_WriteBit(D6_GPIO_Port, D6_Pin, Bit_SET);
		GPIO_WriteBit(D7_GPIO_Port, D7_Pin, Bit_SET);
		GPIO_WriteBit(D8_GPIO_Port, D8_Pin, Bit_SET);
		GPIO_WriteBit(D9_GPIO_Port, D9_Pin, Bit_SET);

		GPIO_WriteBit(A_GPIO_Port, A_Pin, Bit_SET);
		GPIO_WriteBit(B_GPIO_Port, B_Pin, Bit_SET);
		GPIO_WriteBit(C_GPIO_Port, C_Pin, Bit_SET);
		GPIO_WriteBit(D_GPIO_Port, D_Pin, Bit_SET);
		GPIO_WriteBit(E_GPIO_Port, E_Pin, Bit_SET);
		GPIO_WriteBit(F_GPIO_Port, F_Pin, Bit_SET);
		GPIO_WriteBit(G_GPIO_Port, G_Pin, Bit_SET);

}

void IO_GPIO_INIT(void)
{
		GPIO_InitTypeDef GPIO_InitStructure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE); 
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);   
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOF, ENABLE);  
	
    GPIO_StructInit(&GPIO_InitStructure);  
	
		//OUT1_GPIO_Port,OUT2_GPIO_Port
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; 
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz; 
	
	  GPIO_InitStructure.GPIO_Pin = OUT1_Pin;                              
		GPIO_Init(OUT1_GPIO_Port, &GPIO_InitStructure);

		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;                               
		GPIO_Init(GPIOA, &GPIO_InitStructure);

}


void TIM14_init(void)
{
//	TIM_TimeBaseInitTypeDef 		timer_init_structure; 
//	NVIC_InitTypeDef 						NVIC_InitStructure;
//	TIM_OCInitTypeDef         	TIM_OCInitStructure;
//	
//	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE); 
//	
//	NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;                //Ê¹ÄÜTIM3ÖÐ¶ÏÍ¨µÀ  
//	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority= 3;  
//	NVIC_InitStructure.NVIC_IRQChannelSubPriority= 3;          
//	NVIC_InitStructure.NVIC_IRQChannelCmd=ENABLE;     
//	NVIC_Init(&NVIC_InitStructure);
//	
//	/*TIM4*/
//	TIM_DeInit(TIM4);                                               //¸´Î»TIM3
//	TIM_TimeBaseStructInit(&timer_init_structure);                  //³õÊ¼»¯TIM½á¹¹Ìå  

//	timer_init_structure.TIM_ClockDivision = TIM_CKD_DIV1;          //ÏµÍ³Ê±ÖÓ,²»·ÖÆµ,24M  
//	timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;      //ÏòÉÏ¼ÆÊýÄ£Ê½  
//	timer_init_structure.TIM_Period = 5000;                          //Ã¿300 uS´¥·¢Ò»´ÎÖÐ¶Ï,??ADC  
//	timer_init_structure.TIM_Prescaler = 0;                      //¼ÆÊýÊ±ÖÓ·ÖÆµ,f=1M,systick=1 uS  
//	timer_init_structure.TIM_RepetitionCounter = 0x00;              //·¢Éú0+1µÄupdateÊÂ¼þ²úÉúÖÐ¶Ï 
//	
//			/*OCInit Channel 1 Configuration in PWM mode */
//		TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;                                
//		TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;         
//		TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Disable;
//		TIM_OCInitStructure.TIM_Pulse = 96;                                  	//PWM      96->1.5us                
//		TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;                 
//		TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_Low;     
//		TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
//		TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset; 


//		TIM_OC4Init(TIM4,&TIM_OCInitStructure);                                                 
//		TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);	
//	
//	TIM_TimeBaseInit(TIM4, &timer_init_structure);  
//	
//	TIM_ITConfig(TIM4, TIM_IT_Update, ENABLE);                       //Ê¹ÄÜTIM3ÖÐ¶Ï
//	TIM_ITConfig(TIM4, TIM_IT_CC4 , ENABLE);
//	
//	TIM_Cmd(TIM4, ENABLE);                                          //Ê¹ÄÜTIM3
//	
//	

}


void TIM3_init(void)
{
	TIM_TimeBaseInitTypeDef timer_init_structure; 
	NVIC_InitTypeDef NVIC_InitStructure;
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE); 
	
	NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;                //Ê¹ÄÜTIM3ÖÐ¶ÏÍ¨µÀ  
	NVIC_InitStructure.NVIC_IRQChannelPriority = 10;
	NVIC_InitStructure.NVIC_IRQChannelCmd=ENABLE;     
	NVIC_Init(&NVIC_InitStructure);
//	
	/*TIM3*/
	TIM_DeInit(TIM3);                                               //¸´Î»TIM3
	TIM_TimeBaseStructInit(&timer_init_structure);                  //³õÊ¼»¯TIM½á¹¹Ìå  

	timer_init_structure.TIM_ClockDivision = TIM_CKD_DIV1;          //ÏµÍ³Ê±ÖÓ,²»·ÖÆµ,24M  
	timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;      //ÏòÉÏ¼ÆÊýÄ£Ê½  
	timer_init_structure.TIM_Period = 50;                          //Ã¿300 uS´¥·¢Ò»´ÎÖÐ¶Ï,??ADC  
	timer_init_structure.TIM_Prescaler = 23;                      //¼ÆÊýÊ±ÖÓ·ÖÆµ,f=1M,systick=1 uS  
	timer_init_structure.TIM_RepetitionCounter = 0x00;              //·¢Éú0+1µÄupdateÊÂ¼þ²úÉúÖÐ¶Ï 
	
	TIM_SelectOutputTrigger(TIM3, TIM_TRGOSource_Update);							//Ñ¡ÔñTIM1µÄtimerÎª´¥·¢Ô´  
	TIM_TimeBaseInit(TIM3, &timer_init_structure);  
	TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);                       //Ê¹ÄÜTIM3ÖÐ¶Ï
	TIM_Cmd(TIM3, ENABLE);                                          //Ê¹ÄÜTIM3

}


void TIM2_GPIO_Init(void)
{
		GPIO_InitTypeDef GPIO_InitStructure;
		
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);  
 	
	  GPIO_InitStructure.GPIO_Pin = PWM_Pin;  
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;                   //????(??)??  
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    GPIO_InitStructure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    //??  
    GPIO_Init(PWM_GPIO_Port, &GPIO_InitStructure);
	
		GPIO_PinAFConfig(PWM_GPIO_Port,GPIO_PinSource5,GPIO_AF_2);
		
}
void TIM2_PWM_OUT_Init(void)
{
		TIM_OCInitTypeDef         TIM_OCInitStructure;
	
			/*OCInit Channel 1 Configuration in PWM mode */
		TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;                                
		TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;         
		TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Disable;                                        
		TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;                 
		TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_Low;     
		TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
		TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset; 

		TIM_OCInitStructure.TIM_Pulse = 10;  	//PWM      96->1.5us 
		TIM_OC1Init(TIM2,&TIM_OCInitStructure);                                                 
		TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Enable);	
		
//		TIM_OCInitStructure.TIM_Pulse = 1600;                                   //ATT100	25us                
//		TIM_OC2Init(TIM2,&TIM_OCInitStructure);                                                
//		TIM_OC2PreloadConfig(TIM2, TIM_OCPreload_Enable);	
//	
//		TIM_OCInitStructure.TIM_Pulse = 256;                                   //PWM1     256->4us      
//		TIM_OC3Init(TIM2,&TIM_OCInitStructure);                                                 
//		TIM_OC3PreloadConfig(TIM2, TIM_OCPreload_Enable);	
//	
//		TIM_OCInitStructure.TIM_Pulse = 109;                                   //PWM2    109->1.7us
//		TIM_OC4Init(TIM2,&TIM_OCInitStructure);                                                 
//		TIM_OC4PreloadConfig(TIM2, TIM_OCPreload_Enable);	
//		
		TIM_CtrlPWMOutputs(TIM2,ENABLE);
		
}


void TIM2_init(void)  
{  
		TIM_TimeBaseInitTypeDef   TIM_TimeBaseStructure;
		NVIC_InitTypeDef NVIC_InitStructure;
	
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

		TIM2_GPIO_Init();
		TIM2_PWM_OUT_Init();
	
		/*MVIC*/
		//NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0);
		NVIC_InitStructure.NVIC_IRQChannelPriority = 8;
		NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;                //Ê¹ÄÜTIM2ÖÐ¶ÏÍ¨µÀ  
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;                //Ê¹ÄÜTIM2ÖÐ¶Ï  
    NVIC_Init(&NVIC_InitStructure); 
		
		/*TIM2 Base Init*/
    TIM_DeInit(TIM2);                                               //¸´Î»TIM2  
		TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;          //ÏµÍ³Ê±ÖÓ,²»·ÖÆµ,24M  
		TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;      //ÏòÉÏ¼ÆÊýÄ£Ê½  
		TIM_TimeBaseStructure.TIM_Period = 47;                          //Ã¿100 uS´¥·¢Ò»´ÎÖÐ¶Ï,??ADC  
		TIM_TimeBaseStructure.TIM_Prescaler = 23;                      //¼ÆÊýÊ±ÖÓ·ÖÆµ,f=1M,systick=1 uS  
		TIM_TimeBaseStructure.TIM_RepetitionCounter = 0x00;              //·¢Éú0+1µÄupdateÊÂ¼þ²úÉúÖÐ¶Ï 
		
		TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
		TIM_ARRPreloadConfig(TIM2, ENABLE);
		TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);                      //Ê¹ÄÜTIM2ÖÐ¶Ï

		TIM_Cmd(TIM2, ENABLE);
		
		
}  

void TIM1_GPIO_Init(void)
{
		GPIO_InitTypeDef GPIO_InitStructure;
		
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);  
 	
	  GPIO_InitStructure.GPIO_Pin = CLK_Pin;  
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;                   //????(??)??  
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    GPIO_InitStructure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    //??  
    GPIO_Init(CLK_GPIO_Port, &GPIO_InitStructure);
	
		GPIO_PinAFConfig(CLK_GPIO_Port,GPIO_PinSource8,GPIO_AF_2);
		
}
void TIM1_Init(void)
{
	
    TIM_TimeBaseInitTypeDef timer_init_structure;  
		TIM_OCInitTypeDef timer_OCinit_structure; 
		NVIC_InitTypeDef NVIC_InitStructure;

		RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
		
		TIM1_GPIO_Init();
		
		/*MVIC*/
		NVIC_InitStructure.NVIC_IRQChannelPriority = 1;
		NVIC_InitStructure.NVIC_IRQChannel = TIM1_BRK_UP_TRG_COM_IRQn;                //Ê¹ÄÜTIM22ÖÐ¶ÏÍ¨µÀ  
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;                //Ê¹ÄÜTIM2ÖÐ¶Ï  
		NVIC_Init(&NVIC_InitStructure); 
			
	
  /* Time ??????*/
  timer_init_structure.TIM_Prescaler = 3;
  timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;  /* Time ????????????*/
  timer_init_structure.TIM_Period = 25;
  timer_init_structure.TIM_RepetitionCounter = 0;

  TIM_TimeBaseInit(TIM1, &timer_init_structure);

  /* ??1,2,3,4?PWM ???? */
  timer_OCinit_structure.TIM_OCMode = TIM_OCMode_PWM1;
  timer_OCinit_structure.TIM_OutputState = TIM_OutputState_Enable ;//TIM_OutputState_Enable; //PWM?????
  timer_OCinit_structure.TIM_OutputNState = TIM_OutputNState_Disable ;//TIM_OutputNState_Enable; //??PWM?????
  timer_OCinit_structure.TIM_OCPolarity = TIM_OCPolarity_High;  //PWM 1?????
  timer_OCinit_structure.TIM_OCNPolarity = TIM_OCNPolarity_Low; //PWM?? 0?????
  timer_OCinit_structure.TIM_OCIdleState = TIM_OCIdleState_Set;
  timer_OCinit_structure.TIM_OCNIdleState = TIM_OCIdleState_Reset;

  timer_OCinit_structure.TIM_Pulse = 13; //?????
  TIM_OC1Init(TIM1, &timer_OCinit_structure);//????1??
	TIM_OC1PreloadConfig(TIM1,TIM_OCPreload_Enable);
	TIM_CtrlPWMOutputs(TIM1, ENABLE);
	
  TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);                      //Ê¹ÄÜTIM1ÖÐ¶Ï
	TIM_ARRPreloadConfig(TIM1,ENABLE);
	
  /* TIM1 ?????*/
	TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_Update);							//Ñ¡ÔñTIM1µÄtimerÎª´¥·¢Ô´  ´  
	TIM_ClearITPendingBit(TIM1, TIM_IT_Update);     //Çå³ýupdateÊÂ¼þÖÐ¶Ï±êÖ¾
 
	

  TIM_Cmd(TIM1, ENABLE);
	
  /* TIM1 ????? */
}

void ADC1_GPIO_Config()
{
    GPIO_InitTypeDef gpio_init_structure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA , ENABLE);  
    //GPIOA                                                         //PA-0~3??ADC  
    gpio_init_structure.GPIO_Pin = ADCIN_1_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_AN;                   //????(??)??  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 //????  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                    //??  
    GPIO_Init(ADCIN_1_GPIO_Port, &gpio_init_structure);  	
}

void ADC1_DMA1_Init()
{
	DMA_InitTypeDef DMA_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
	
	//NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);

	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	/* DMA1 channel1 configuration ----------------------------------------------*/
  DMA_DeInit(DMA1_Channel1);
  DMA_InitStructure.DMA_PeripheralBaseAddr = ADC1_DR_ADDRESS;
  DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)&adc_dma_tab;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  DMA_InitStructure.DMA_BufferSize = DMA_BUFFER_SIZE;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
  DMA_InitStructure.DMA_Priority = DMA_Priority_High;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(DMA1_Channel1, &DMA_InitStructure);
	
	DMA_ClearFlag(DMA1_FLAG_TC1);
  DMA_ClearITPendingBit(DMA1_IT_TC1);
  
	DMA_ITConfig(DMA1_Channel1, DMA_IT_TC, ENABLE);  //DMA´«ÊäÍê³ÉÖÐ¶Ï
	
	  /* Enable DMA1 channel1 */
  DMA_Cmd(DMA1_Channel1, ENABLE);
	
}






void ADC1_Init(void)
{
		ADC_InitTypeDef ADC_InitStructure;  
		NVIC_InitTypeDef NVIC_InitStructure;
	
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);            //??ADC?? 

		NVIC_InitStructure.NVIC_IRQChannel = ADC1_IRQn;
		NVIC_InitStructure.NVIC_IRQChannelPriority = 0;
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVIC_InitStructure);
		
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;            //????????  
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;         //???????  
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T1_TRGO; //???????TIM1
    ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_Falling;//?????  
    ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;         //12????  
    ADC_InitStructure.ADC_ScanDirection = ADC_ScanDirection_Upward;//????0-18??  
		
    ADC_Init(ADC1, &ADC_InitStructure);  
	
    ADC_OverrunModeCmd(ADC1, ENABLE);                               //????????  
    ADC_ChannelConfig(ADC1, ADC_Channel_2, ADC_SampleTime_28_5Cycles);               //??????,????125nS  
    ADC_GetCalibrationFactor(ADC1);                                 //?????ADC  
    ADC_Cmd(ADC1, ENABLE);                                          //??ADC1  
    while(ADC_GetFlagStatus(ADC1, ADC_FLAG_ADEN) == RESET);         //??ADC1????  
  
    ADC_DMACmd(ADC1, ENABLE);                                       //??ADC_DMA  
    ADC_DMARequestModeConfig(ADC1, ADC_DMAMode_Circular);           //??DMA?????????  

		ADC_StartOfConversion(ADC1);
}

void ADC1_Configuration(void)
{
    ADC1_GPIO_Config();
    ADC1_DMA1_Init();
    ADC1_Init();
}






